<?php
    $m = 5;//足し算の数
    $n = 5;//引き算の数

    /*足し算と引き算のパターン数をループで確認*/
    $l = 0;
    for ($i = 1; $i <= 100; $i++) {
        $l += $i;
    }

    /*足し算の全パターンを格納した配列を生成*/
    $j = 0;
    $k = 0;
    for ($i = 0; $i < $l; $i++) {
        $addition[] = $j." + ".$k." = ";
        $k++;
        /*$j+$kの値が99を超えてはいけない*/
        if ($j + $k > 99) {
            $j++;
            $k = 0;
        }
    }

    /*引き算も同様に行う*/
    $p = 0;
    $q = 0;
    for ($i = 0; $i < $l; $i++) {
        $subtraction[] = $p." - ".$q." = ";
        $q++;
        /*$p-$qの値が負の数になってはいけない*/
        if ($p - $q < 0) {
            $p++;
            $q = 0;
        }
    }

    /*それぞれの配列の値をシャッフルする*/
    shuffle($addition);
    shuffle($subtraction);

    /*足し算の配列の頭から$m個の要素を取り出して
      別の配列に格納する*/
    for ($i = 0; $i < $m; $i++) {
        $array[] = $addition[$i];
    }

    /*引き算も同様に行う*/
    for ($i = 0; $i < $n; $i++) {
        $array[] = $subtraction[$i];
    }

    /*完成した配列をシャッフルする*/
    shuffle($array);

    /*配列の値を順番に出力する*/
    for ($i = 0; $i < $m + $n; $i++) {
        echo "<h3>$array[$i]</h3>";
    }
?>
